# Home🤖.py
import streamlit as st
primaryColor = "#f63366"
page_by_img =  f"""<style>.stApp {{background-image: url("{"https://img.freepik.com/premium-photo/abstract-background-molecules-technology-with-polygonal-shapes-connecting-dots-lines-connection-structure-big-data-visualization_7247-3288.jpg?w=900"}");background-size: cover;}}</style>"""
st.markdown(page_by_img, unsafe_allow_html=True)
st.title('Youtube Data Harvesting and Warehousing')
if st.button('Click here to Viewproject'):
    st.switch_page(r'pages/Data.py')
st.header('​🇦​​🇧​​🇴​​🇺​​🇹​ ​🇹​​🇭​​🇪​ ​🇵​​🇷​​🇴​​🇯​​🇪​​🇨​​🇹​')
st.write("ɪɴɴᴏᴠᴀᴛɪᴠᴇʟʏ ʜᴀʀɴᴇꜱꜱɪɴɢ ᴛʜᴇ ᴘᴏᴡᴇʀ ᴏꜰ ꜱQʟ ᴅᴀᴛᴀʙᴀꜱᴇꜱ ᴀɴᴅ ꜱᴛʀᴇᴀᴍʟɪᴛ ᴡᴇʙ ꜰʀᴀᴍᴇᴡᴏʀᴋ, ᴛʜɪꜱ ᴘʀᴏᴊᴇᴄᴛ ᴇᴍʙᴀʀᴋꜱ ᴏɴ ᴀ ᴄᴏᴍᴘʀᴇʜᴇɴꜱɪᴠᴇ ᴊᴏᴜʀɴᴇʏ ᴏꜰ ʜᴀʀᴠᴇꜱᴛɪɴɢ ᴀɴᴅ ᴡᴀʀᴇʜᴏᴜꜱɪɴɢ ʏᴏᴜᴛᴜʙᴇ ᴅᴀᴛᴀ. ʙʏ ɪɴᴛʀɪᴄᴀᴛᴇʟʏ ɪɴᴛᴇʀᴛᴡɪɴɪɴɢ ᴅᴀᴛᴀ ᴀᴄQᴜɪꜱɪᴛɪᴏɴ ᴍᴇᴛʜᴏᴅᴏʟᴏɢɪᴇꜱ ᴡɪᴛʜ ꜱᴛʀᴇᴀᴍʟɪɴᴇᴅ ꜱᴛᴏʀᴀɢᴇ ᴛᴇᴄʜɴɪQᴜᴇꜱ, ɪᴛ ᴘʀᴏᴠɪᴅᴇꜱ ᴀ ʀᴏʙᴜꜱᴛ ᴘʟᴀᴛꜰᴏʀᴍ ꜰᴏʀ ɪɴꜱɪɢʜᴛꜰᴜʟ ᴇxᴘʟᴏʀᴀᴛɪᴏɴ ᴀɴᴅ ᴀɴᴀʟʏꜱɪꜱ. ᴛʜʀᴏᴜɢʜ ᴀ ᴍᴇᴛɪᴄᴜʟᴏᴜꜱʟʏ ᴄʀᴀꜰᴛᴇᴅ ɪɴᴛᴇʀꜰᴀᴄᴇ, ᴜꜱᴇʀꜱ ᴀʀᴇ ɪɴᴠɪᴛᴇᴅ ᴛᴏ ᴅᴇʟᴠᴇ ɪɴᴛᴏ ᴛʜᴇ ʀɪᴄʜ ᴛᴀᴘᴇꜱᴛʀʏ ᴏꜰ ʏᴏᴜᴛᴜʙᴇ'ꜱ ᴄᴏɴᴛᴇɴᴛ ʟᴀɴᴅꜱᴄᴀᴘᴇ, ᴜɴʟᴏᴄᴋɪɴɢ ʜɪᴅᴅᴇɴ ᴛʀᴇɴᴅꜱ, ᴘᴀᴛᴛᴇʀɴꜱ, ᴀɴᴅ ɪɴꜱɪɢʜᴛꜱ ᴡɪᴛʜ ᴜɴᴘᴀʀᴀʟʟᴇʟᴇᴅ ᴇᴀꜱᴇ ᴀɴᴅ ᴇꜰꜰɪᴄɪᴇɴᴄʏ. ᴛʜɪꜱ ᴇɴᴅᴇᴀᴠᴏʀ ʀᴇᴘʀᴇꜱᴇɴᴛꜱ ᴀ ᴘɪᴏɴᴇᴇʀɪɴɢ ᴇꜰꜰᴏʀᴛ ɪɴ ʟᴇᴠᴇʀᴀɢɪɴɢ ᴛᴇᴄʜɴᴏʟᴏɢʏ ᴛᴏ ᴅᴇᴄᴏᴅᴇ ᴛʜᴇ ᴠᴀꜱᴛ ʀᴇᴘᴏꜱɪᴛᴏʀʏ ᴏꜰ ᴅɪɢɪᴛᴀʟ ᴄᴏɴᴛᴇɴᴛ, ᴇᴍᴘᴏᴡᴇʀɪɴɢ ᴜꜱᴇʀꜱ ᴡɪᴛʜ ᴛʜᴇ ᴛᴏᴏʟꜱ ᴛʜᴇʏ ɴᴇᴇᴅ ᴛᴏ ɴᴀᴠɪɢᴀᴛᴇ ᴀɴᴅ ᴜɴᴅᴇʀꜱᴛᴀɴᴅ ᴛʜᴇ ᴇᴠᴇʀ-ᴇᴠᴏʟᴠɪɴɢ ᴏɴʟɪɴᴇ ᴇᴄᴏꜱʏꜱᴛᴇᴍ.")
st.header('🇨​​🇭​​🇦​​🇷​​🇦​​🇨​​🇹​​🇪​​🇷​​🇮​​🇸​​🇹​​🇮​​🇨​')
st.write("💠 ᴅᴀᴛᴀ ᴀᴄQᴜɪꜱɪᴛɪᴏɴ: ᴇxᴛʀᴀᴄᴛɪɴɢ ʏᴏᴜᴛᴜʙᴇ ᴅᴀᴛᴀ ɪɴᴄʟᴜᴅɪɴɢ ᴠɪᴅᴇᴏ ᴅᴇᴛᴀɪʟꜱ, ᴠɪᴇᴡᴇʀ ᴇɴɢᴀɢᴇᴍᴇɴᴛ ᴍᴇᴛʀɪᴄꜱ, ᴀɴᴅ ᴄʜᴀɴɴᴇʟ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ.")
st.write("💠 ᴅᴀᴛᴀ ꜱᴛᴏʀᴀɢᴇ ᴀʀᴄʜɪᴛᴇᴄᴛᴜʀᴇ: ᴅᴇꜱɪɢɴɪɴɢ ᴀ ᴅᴀᴛᴀʙᴀꜱᴇ ꜱᴛʀᴜᴄᴛᴜʀᴇ ᴏᴘᴛɪᴍɪᴢᴇᴅ ꜰᴏʀ ᴇꜰꜰɪᴄɪᴇɴᴛ ꜱᴛᴏʀᴀɢᴇ ᴀɴᴅ ʀᴇᴛʀɪᴇᴠᴀʟ ᴏꜰ ʏᴏᴜᴛᴜʙᴇ ᴅᴀᴛᴀ.")
st.write("💠 ꜱᴛʀᴜᴄᴛᴜʀᴇᴅ Qᴜᴇʀʏ ɪɴᴛᴇʀꜰᴀᴄᴇ: ᴄʀᴇᴀᴛɪɴɢ ᴀɴ ɪɴᴛᴜɪᴛɪᴠᴇ ɪɴᴛᴇʀꜰᴀᴄᴇ ꜰᴏʀ ᴜꜱᴇʀꜱ ᴛᴏ ɪɴᴛᴇʀᴀᴄᴛ ᴡɪᴛʜ ᴛʜᴇ ᴅᴀᴛᴀʙᴀꜱᴇ ᴜꜱɪɴɢ ꜱQʟ Qᴜᴇʀɪᴇꜱ.")
st.write("💠 ɪɴᴛᴇʀᴀᴄᴛɪᴠᴇ ᴡᴇʙ ɪɴᴛᴇʀꜰᴀᴄᴇ: ᴅᴇᴠᴇʟᴏᴘɪɴɢ ᴀ ᴜꜱᴇʀ-ꜰʀɪᴇɴᴅʟʏ ᴡᴇʙ ᴀᴘᴘʟɪᴄᴀᴛɪᴏɴ ᴡɪᴛʜ ꜱᴛʀᴇᴀᴍʟɪᴛ ꜰᴏʀ ᴀᴄᴄᴇꜱꜱɪɴɢ ᴀɴᴅ ᴀɴᴀʟʏᴢɪɴɢ ʏᴏᴜᴛᴜʙᴇ ᴅᴀᴛᴀ.")
st.write("💠 ᴜꜱᴇʀ ᴀᴄᴄᴇꜱꜱ ᴍᴀɴᴀɢᴇᴍᴇɴᴛ: ɪᴍᴘʟᴇᴍᴇɴᴛɪɴɢ ᴀᴜᴛʜᴇɴᴛɪᴄᴀᴛɪᴏɴ ᴀɴᴅ ᴀᴜᴛʜᴏʀɪᴢᴀᴛɪᴏɴ ᴍᴇᴄʜᴀɴɪꜱᴍꜱ ᴛᴏ ᴄᴏɴᴛʀᴏʟ ᴀᴄᴄᴇꜱꜱ ᴛᴏ ᴛʜᴇ ᴀᴘᴘʟɪᴄᴀᴛɪᴏɴ ᴀɴᴅ ᴅᴀᴛᴀ.")
st.write("💠 ʀᴇᴀʟ-ᴛɪᴍᴇ ᴅᴀᴛᴀ ɪɴᴛᴇɢʀᴀᴛɪᴏɴ: ɪɴᴛᴇɢʀᴀᴛɪɴɢ ʀᴇᴀʟ-ᴛɪᴍᴇ ᴅᴀᴛᴀ ᴜᴘᴅᴀᴛᴇꜱ ꜰʀᴏᴍ ʏᴏᴜᴛᴜʙᴇ ᴀᴘɪ ᴛᴏ ᴇɴꜱᴜʀᴇ ᴛʜᴇ ᴀᴘᴘʟɪᴄᴀᴛɪᴏɴ ʀᴇꜰʟᴇᴄᴛꜱ ᴛʜᴇ ʟᴀᴛᴇꜱᴛ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ.")
